/*
 * Copyright (c) 2026, Victor Agarkov
 *            victoragarkov@gmail.com
 *
 * SPDX-License-Identifier: GPL-3.0-or-later
 */

/*
 *  Реализация колцевого буфера (очереди) для хранения 32-битных
 *  значений.
 *  Не является потокобезопасной.
 **/

#include "rb32.h"
#include "pico/stdlib.h"
//#include "hardware/flash.h"

//--------------------------------------------------------------------------------------------------------
// внутренняя функция, вызывается после проведения проверок.
// возвращает индекс буфера, куда будет писаться следующее значение
static size_t rb32_next_wr_ptr(size_t curr_wr, size_t len)
{
	size_t next_wr_ptr = curr_wr + 1;
	if(next_wr_ptr >= len) next_wr_ptr -= len;
	return next_wr_ptr;
}
//--------------------------------------------------------------------------------------------------------
// записываем новое значение.
// если нет места - ждём, пока другой поток его освободит
void rb32_put_block(rb32_t *rb, uint32_t src)
{
	size_t curr_wr = rb->wr_ptr;
	size_t next_wr_ptr = rb32_next_wr_ptr(curr_wr, rb->len);
	// если нет свободного места - ждём, пока освободиться
	while(next_wr_ptr == rb->rd_ptr);	  
	rb->buff[curr_wr] = src;
	rb->wr_ptr = next_wr_ptr;
}
//--------------------------------------------------------------------------------------------------------
// пытаемся записать новое значение.
// Возврат:
// 0 - нет свободного места, запись не произведена
// 1 - запись произведена успешно
__attribute__((noinline, section(".scratch_x.rb32_functions")))
int rb32_try_put(rb32_t *rb, uint32_t src)
{
	size_t curr_wr = rb->wr_ptr;
	size_t next_wr_ptr = rb32_next_wr_ptr(curr_wr, rb->len);
	// если нет свободного места - выходим с 0
	if(next_wr_ptr == rb->rd_ptr) return 0;
	rb->buff[curr_wr] = src;
	rb->wr_ptr = next_wr_ptr;
	return 1;
}
//--------------------------------------------------------------------------------------------------------
// внутренняя функция
// возвращает без проверок очередное значение
// передвигает указатель чтения
uint32_t rb32_get(rb32_t *rb)
{
	size_t   rd_ptr = rb->rd_ptr;
	uint32_t ret    = rb->buff[rd_ptr++];
	if(rd_ptr >= rb->len) rd_ptr -= rb->len;
	rb->rd_ptr = rd_ptr;
	return ret;	
}
//--------------------------------------------------------------------------------------------------------
// получить очередное значение.
// если буфер пуст - ждём, пока другой поток что-нибудь запишет
uint32_t rb32_get_block(rb32_t *rb)
{
	while(RB32_IS_EMPTY(rb));
	return rb32_get(rb);
}
//--------------------------------------------------------------------------------------------------------
// пытаемся получить очередное значение
// Возврат:
// 0 - буфер пуст, чтение не произведено
// 1 - чтение произведено, считанное значение записано в *dst
__attribute__((noinline, section(".scratch_x.rb32_functions")))
int rb32_try_get(rb32_t *rb, uint32_t *dst)
{
	if(RB32_IS_EMPTY(rb)) return 0;
	*dst = rb32_get(rb);
	return 1;
}

//--------------------------------------------------------------------------------------------------------
